Revit 2026 API

# DoubleClickOptionsGetRenameOnSlowDoubleClickInProjectBrowser Method

---

Returns the user's desire to rename item in project browser on slow double-click.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool GetRenameOnSlowDoubleClickInProjectBrowser()
```
```vb
Public Function GetRenameOnSlowDoubleClickInProjectBrowser As Boolean
```
```cpp
public:
bool GetRenameOnSlowDoubleClickInProjectBrowser()
```
```fsharp
member GetRenameOnSlowDoubleClickInProjectBrowser : unit -> bool
```

#### Return Value

Boolean

#### Reference

DoubleClickOptions Class

Autodesk.Revit.UI Namespace